/// 用于表示矩形区域，rect 表示 BlockData 的有效区域
#[derive(Debug, Copy, Clone)]
pub struct Rect {
    pub x: usize,      // 在 grid 中有效区域左上角的 x 坐标
    pub y: usize,      // 在 grid 中有效区域左上角的 y 坐标
    pub width: usize,  // 有效区域宽度
    pub height: usize, // 有效区域高度
}

/// 用于描述方块数据，包含 5×5 的 grid 以及预计算好的有效区域 rect
#[derive(Debug)]
pub struct BlockData {
    pub grid: [[u8; 5]; 5],
    pub rect: Rect,
}

pub const SHAPE_IDX: [usize; 23] = [
    0, 1, 2, 5, 6, 7, 8, 9, 10, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 49
];

pub const SHAPE_IDX_COCOS: [usize; 27] = [
    0, 2, 1, 6, 5, 14, 13, 33, 32, 7, 8, 9, 10, 20, 21, 22, 23, 24, 25, 26, 27, 15, 16, 17, 18, 19, 49
];

pub const SHAPE: [BlockData; 50] = [
    //1
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 2,
            height: 1,
            width: 1,
        },
    },
    //2
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 2,
            height: 1,
            width: 2,
        },
    },
    //3
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 2,
            height: 2,
            width: 1,
        },
    },
    //4
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 2,
            height: 2,
            width: 2,
        },
    },
    //5
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 2,
            width: 2,
        },
    },
    //6
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 1,
            width: 3,
        },
    },
    //7
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 1,
            height: 3,
            width: 1,
        },
    },
    //8
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 1,
            height: 2,
            width: 2,
        },
    },
    //9
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 2,
        },
    },
    //10
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 2,
        },
    },
    //11
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 2,
        },
    },
    //12
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //13
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //14
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 1,
            width: 4,
        },
    },
    //15
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 1,
            height: 4,
            width: 1,
        },
    },
    //16
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 1,
            height: 2,
            width: 2,
        },
    },
    //17
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 3,
        },
    },
    //18
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //19
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 2,
            width: 3,
        },
    },
    //20
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //21
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //22
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 2,
            width: 3,
        },
    },
    //23
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //24
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 3,
        },
    },
    //25
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //26
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 3,
        },
    },
    //27
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //28
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 2,
            width: 3,
        },
    },
    //29
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //30
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 2,
            width: 3,
        },
    },
    //31
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //32
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 2,
            height: 2,
            width: 3,
        },
    },
    //33
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [1, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 0,
            y: 2,
            height: 1,
            width: 5,
        },
    },
    //34
    BlockData {
        grid: [
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
        ],
        rect: Rect {
            x: 2,
            y: 0,
            height: 5,
            width: 1,
        },
    },
    //35
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //36
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 0, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //37
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //38
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //39
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 3,
        },
    },
    //40
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //41
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //42
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //43
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //44
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //45
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
    //46
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 0, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 3,
        },
    },
    //47
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //48
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 0, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 2,
            width: 3,
        },
    },
    //49
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 2,
        },
    },
    //50
    BlockData {
        grid: [
            [0, 0, 0, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        rect: Rect {
            x: 1,
            y: 1,
            height: 3,
            width: 3,
        },
    },
];

